; domain
(define (domain gripper-strips)
  (:types room ball gripper)

   (:predicates (at-robby ?r - room)
		(at ?b - ball ?r - room)
		(free ?g - gripper)
		(carry ?b - ball ?g - gripper))

   (:action move
       :parameters  (?o1 ?o2 - room)
       :precondition (and  (at-robby ?o1) (not (at-robby ?o2)))
       :effect (and  (at-robby ?o2)
		     (not (at-robby ?o1))))



   (:action pick
       :parameters (?o1 - ball ?o2 - room ?o3 - gripper)
       :precondition  (and  (at ?o1 ?o2) (at-robby ?o2) (free ?o3))
       :effect (and (carry ?o1 ?o3)
		    (not (at ?o1 ?o2)) 
		    (not (free ?o3))))


   (:action drop
       :parameters (?o1 - ball ?o2 - room ?o3 - gripper)
       :precondition  (and  (carry ?o1 ?o3) (at-robby ?o2))
       :effect (and (at ?o1 ?o2)
		    (free ?o3)
		    (not (carry ?o1 ?o3)))))

; problem
(define (problem strips-gripper-x-2)
   (:domain gripper-strips)
   (:objects rooma roomb - room ball4 ball3 ball2 ball1 - ball left right - gripper)   
   (:init
          (at ball1 roomb)	
          (at ball2 roomb)
          (at ball4 rooma)
	  
          (free left)
	  (carry ball3 right)
	  
          (at-robby roomb))
	  
   (:goal (and   	  	  
          (at ball1 roomb)	  
          (at ball2 roomb)
          (at ball3 roomb)	  
          (at ball4 roomb)
	  
          (not (at ball1 rooma))
          (not (at ball2 rooma))
          (not (at ball3 rooma))	  	  
          (not (at ball4 rooma))	 

          (free left)
          (free right)

	  (not (carry ball1 left))
	  (not (carry ball2 left))
	  (not (carry ball3 left))	  
	  (not (carry ball4 left))
	  
	  (not (carry ball1 right))
	  (not (carry ball2 right))
	  (not (carry ball3 right))
	  (not (carry ball4 right))	  
	  
          (at-robby rooma)
          (not (at-robby roomb))	  
)))

; plan
1. (drop ball3 roomb right)
   deleted: (carry ball3 right)
   added: (at ball3 roomb) (free right)
   goals met: 16 of 20
2. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 18 of 20
3. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 17 of 20
4. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 15 of 20
5. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 18 of 20
6. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 20 of 20
